import "../css/AboutUsBlog.css";

const AboutUsBlog = () => {
  return (
    <section className="about-us-blog-wrapper">
      <h2 className="about-us-blog-header">
        عن منصة "علم بسعادة" | لأن المعلم السعيد يصنع الفرق
      </h2>

      <h3 className="about-us-blog-subheader">الفكرة الأساسية :</h3>

      <div className="about-us-blog-text">
        التعليم رسالة سامية وقيمة إنسانية عظيمة، قد يواجه المعلم فيه تحديات
        وضغوطًا تؤثر على شغفه وحماسه. "هنا تأتي{" "}
        <strong style={{ color: "var(--purple)" }}>علم بسعادة</strong> لتعيد
        للمعلم متعة التدريس، وتساعده على الاستمتاع بمهنته من خلال تمكينه بأدوات
        واستراتيجيات حديثة تجعل التعليم تجربة أكثر إبداعًا، تأثيرًا، وسعادة.
        <br />
        <br />
        <strong style={{ color: "var(--purple)" }}>الهدف الأسمى: </strong>
        نؤمن بأن المعلم السعيد هو مفتاح التعليم الفعّال، ولهذا تسعى المنصة إلى:
        <ul>
          <li>
            تمكين المعلمين بأدوات واستراتيجيات تجعل التدريس أكثر متعة وتأثيرًا.
          </li>
          <li>
            مساعدة المعلمين على إدارة وقتهم وضغوطهم بطريقة ذكية، ليجدوا توازنًا
            بين العمل والحياة.
          </li>
          <li>
            تعزيز بيئة تعليمية تفاعلية ومبتكرة تجعل التعلم تجربة إيجابية للطلاب
            والمعلمين معًا.
          </li>
          <li>
            بناء مجتمع تعليمي داعم يتيح تبادل الخبرات وتطوير الأداء المهني.
          </li>
        </ul>
      </div>

      <h3 className="about-us-blog-subheader">ماذا نقدم؟</h3>
      <p className="about-us-blog-text">
        استشارات تعليمية فردية وجماعية لدعم المعلمين في تطوير مهاراتهم، مواجهة
        التحديات الصفية، وتحسين ممارساتهم التدريسية. أدوات واستراتيجيات عملية
        تساعد المعلمين على التخطيط، التنفيذ، والتقييم بطرق مبتكرة. مجتمع تفاعلي
        قريب من الواقع يجمع المعلمين والمعلمات لتبادل الخبرات وأفضل الممارسات
        التربوية. موارد رقمية قابلة للتحميل تساعد في تنظيم العملية التعليمية
        وجعلها أكثر كفاءة. كل ما تحتاجه لتكون معلمًا أكثر تأثيرًا، إبداعًا،
        وسعادة تجده هنا في "علم بسعادة"!
      </p>

      <h3 className="about-us-blog-subheader">لماذا اسم "علم بسعادة"؟ </h3>
      <p className="about-us-blog-text">
        لأننا نؤمن بأن المعلم السعيد ينقل طاقته الإيجابية إلى طلابه . لأن
        التعليم الفعّال لا يقتصر على المناهج والكتب، بل على شغف المعلم ورسالته .
        لأننا نريد أن يكون التعليم رحلة ممتعة، وليس عبئًا !
      </p>
    </section>
  );
};

export default AboutUsBlog;
